<a href="https://colab.research.google.com/github/AvinashShrikhande/Pandas-Tricks/blob/main/Pandas_for_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

### **1.Create an example DataFrame**

In [ ]:
df = pd.DataFrame({'col one':[100,200],'col two':[300,400]})
df

   col one  col two
0      100      300
1      200      400

In [ ]:
pd.DataFrame(np.random.rand(4,8))

          0         1         2  ...         5         6         7
0  0.259616  0.201086  0.982712  ...  0.004244  0.557932  0.543363
1  0.226521  0.083115  0.694874  ...  0.883843  0.028440  0.918146
2  0.246831  0.485230  0.838053  ...  0.824909  0.749766  0.897438
3  0.862735  0.596312  0.457055  ...  0.307317  0.942778  0.473067

[4 rows x 8 columns]

In [ ]:
#Enter the same no of string length as column here its 8 col as len("abcdefg")=8 
pd.DataFrame(np.random.rand(4,8), columns = list('abcdefgh'))

          a         b         c  ...         f         g         h
0  0.719095  0.968299  0.054972  ...  0.140996  0.924949  0.797554
1  0.875943  0.458579  0.136004  ...  0.613794  0.113736  0.708045
2  0.890696  0.187624  0.365470  ...  0.327551  0.728319  0.991210
3  0.844225  0.631421  0.347171  ...  0.840579  0.853156  0.280139

[4 rows x 8 columns]

### **2.Rename columns**

In [ ]:
df

   col one  col two
0      100      300
1      200      400

In [ ]:
# Approach 1
df = df.rename({'col one':'col_one','col two':'col_two'},axis='columns')

In [ ]:
# Approach 2
df.columns = ['col one','col two']
df.columns = df.columns.str.replace(' ' , '_')

In [ ]:
df

In [ ]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [ ]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

### **3.Reverse Row Order**

In [ ]:
df.loc[::-1].head()

In [ ]:
# If want to reset index from Zero of reversed  
df.loc[::-1].reset_index(drop=True).head()

### **4.Reverse column Order**

In [ ]:
# [:,::-1] before "," means rows & after "," means columns
df.loc[:,::-1].head()

### **5.Select column by Data Types**

In [ ]:
df.select_dtypes(include=['number','object']).head()

In [ ]:
df.select_dtypes(exclude=['number'])

### **6.Convert String to number**

In [ ]:
df = pd.DataFrame({'col_one':['1.1','2.2','3.3'],
                   'col_two':['4.4','5.5','6.6'],
                   'col_three':['7.7','8.8','-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [ ]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [ ]:
df.astype({'col_one':'float','col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [ ]:
# If astype used on third column it will give error as it contains '-'
# Instead we use to_numeric() method, it will convert invalid input to NAN
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [ ]:
# Filling NA values with zeros
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [ ]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [ ]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

### **7.Reduce DataFrame Size**

In [ ]:
# Only reading those columns from csv which we need 
cols=['beer_serving','continent']
small_drinks = pd.read_csv('', usecols=cols)
small_drinks.info()